-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Dec 01, 2021 at 01:06 PM
-- Server version: 10.4.21-MariaDB
-- PHP Version: 7.3.31

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `tatcshop`
--

-- --------------------------------------------------------

--
-- Table structure for table `major`
--

CREATE TABLE `major` (
  `major_id` int(10) NOT NULL,
  `major_name` varchar(50) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `major`
--

INSERT INTO `major` (`major_id`, `major_name`) VALUES
(0, 'กรุณาเลือกสาขาวิชา'),
(1, 'ช่างยนต์'),
(2, 'ช่างกลโรงงาน'),
(3, 'เชื่อมโลหะ'),
(4, 'ตรวจสอบโดยไม่ทำงาน (NDT)'),
(5, 'เขียนแบบเครื่องกล'),
(6, 'ไฟฟ้ากำลัง'),
(7, 'อิเล็กทรอนิกส์'),
(8, 'เมคคาทรอนิกส์'),
(9, 'เทคนิคคอมพิวเตอร์'),
(10, 'เทคโนโลยีคอมพิวเตอร์'),
(11, 'เครื่องมือวัดและควบคุม'),
(12, 'ก่อสร้าง'),
(13, 'การโรงแรม'),
(14, 'การท่องเที่ยว'),
(15, 'ธุรกิจการบิน'),
(16, 'การบัญชี'),
(17, 'เทคโนโลยีสารสนเทศ'),
(18, 'คอมพิวเตอร์ธุรกิจ'),
(19, 'การจัดการธุรกิจค้าปลีก'),
(20, 'การจัดการโลจิสติกส์และซัพพลายเชน'),
(21, 'ช่างอากาศยาน'),
(22, 'ช่างซ่อมบำรุงระบบขนส่งทางราง');

-- --------------------------------------------------------

--
-- Table structure for table `member`
--

CREATE TABLE `member` (
  `mem_id` varchar(11) COLLATE utf8_unicode_ci NOT NULL,
  `citizen_id` varchar(13) COLLATE utf8_unicode_ci NOT NULL,
  `prename` enum('นาย','นางสาว') COLLATE utf8_unicode_ci NOT NULL,
  `fname` varchar(50) COLLATE utf8_unicode_ci NOT NULL,
  `lname` varchar(50) COLLATE utf8_unicode_ci NOT NULL,
  `level` varchar(10) COLLATE utf8_unicode_ci NOT NULL,
  `major` varchar(50) COLLATE utf8_unicode_ci NOT NULL,
  `grp` int(2) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `member`
--

INSERT INTO `member` (`mem_id`, `citizen_id`, `prename`, `fname`, `lname`, `level`, `major`, `grp`) VALUES
('64309010001', '1160101775986', 'นางสาว', 'กชพรรณ', 'ปรางศรี', 'ปวส.1', 'เทคโนโลยีสารสนเทศ', 1),
('64309010002', '1200901346558', 'นางสาว', 'กฤติมา', 'พรมจิ๋ว', 'ปวส.1', 'เทคโนโลยีสารสนเทศ', 1),
('64309010003', '1200901337931', 'นาย', 'ชิษณุพงศ์', 'กรกฎ', 'ปวส.1', 'เทคโนโลยีสารสนเทศ', 1),
('64309010004', '1209702089529', 'นาย', 'โชคชัย', 'ใจชุ่มชื่น', 'ปวส.1', 'เทคโนโลยีสารสนเทศ', 1),
('64309010005', '1200901318031', 'นาย', 'ธนวรรธน์', 'จิรชัยเจริญยศ', 'ปวส.1', 'เทคโนโลยีสารสนเทศ', 1),
('64309010006', '1219400005870', 'นางสาว', 'ประภัสสร', 'สุวรรณภูมิ', 'ปวส.1', 'เทคโนโลยีสารสนเทศ', 1),
('64309010007', '1209702051173', 'นาย', 'ปองภพ', 'สิริวิไลเกตุทอง', 'ปวส.1', 'เทคโนโลยีสารสนเทศ', 1),
('64309010008', '1209702099524', 'นาย', 'เผชิญโชค', 'ยินดี', 'ปวส.1', 'เทคโนโลยีสารสนเทศ', 1),
('64309010009', '1219900869300', 'นาย', 'พงศธร', 'ชินอ่อน', 'ปวส.1', 'เทคโนโลยีสารสนเทศ', 1),
('64309010010', '1119902077975', 'นางสาว', 'พรรณชมพู', 'ตื้อคำ', 'ปวส.1', 'เทคโนโลยีสารสนเทศ', 1),
('64309010011', '1209702086333', 'นางสาว', 'พลอยศิลา', 'ปากดี', 'ปวส.1', 'เทคโนโลยีสารสนเทศ', 1),
('64309010012', '1209702080475', 'นาย', 'พีรพล', 'ศรีสวัสดิ์', 'ปวส.1', 'เทคโนโลยีสารสนเทศ', 1),
('64309010013', '1139600168595', 'นาย', 'วรพรต', 'สีสด', 'ปวส.1', 'เทคโนโลยีสารสนเทศ', 1),
('64309010014', '1209702082982', 'นาย', 'วีรภัทร', 'ราชดา', 'ปวส.1', 'เทคโนโลยีสารสนเทศ', 1),
('64309010015', '1209301109928', 'นาย', 'ศุภณัฐ', 'เกตุศิริ', 'ปวส.1', 'เทคโนโลยีสารสนเทศ', 1),
('64309010016', '1209702115473', 'นาย', 'ศุภสัณฑ์', 'ประวาสุข', 'ปวส.1', 'เทคโนโลยีสารสนเทศ', 1),
('64309010017', '1209702075781', 'นาย', 'จักรพงศ์', 'ทัพมงคล', 'ปวส.1', 'เทคโนโลยีคอมพิวเตอร์', 2),
('64309010018', '1209702092287', 'นาย', 'ชทภณ', 'อุบล', 'ปวส.1', 'เทคโนโลยีคอมพิวเตอร์', 2),
('64309010019', '1228900006556', 'นาย', 'รัฐชานนท์', 'จันทนา', 'ปวส.1', 'เทคโนโลยีคอมพิวเตอร์', 2),
('64309010020', '1209301123505', 'นาย', 'ณัฐภัทร', 'เพ็งโคตร', 'ปวส.1', 'เทคโนโลยีคอมพิวเตอร์', 2),
('64309010021', '1200901322764', 'นาย', 'ณัฐสิทธิ์', 'ภูถาวร', 'ปวส.1', 'เทคโนโลยีคอมพิวเตอร์', 2),
('64309010022', '1200901324007', 'นาย', 'ไตรรัตน์', 'นนท์สกุล', 'ปวส.1', 'เทคโนโลยีคอมพิวเตอร์', 2),
('64309010023', '1219400008933', 'นาย', 'ธนภัทร', 'ศรีเจริญ', 'ปวส.1', 'เทคโนโลยีคอมพิวเตอร์', 2),
('64309010024', '1209702072120', 'นาย', 'ธนัช', 'เชษฐนรกุล', 'ปวส.1', 'เทคโนโลยีคอมพิวเตอร์', 2),
('64309010025', '1209601357102', 'นาย', 'ธัชชัย', 'วิบูลย์วุฒิวงศ์', 'ปวส.1', 'เทคโนโลยีคอมพิวเตอร์', 2),
('64309010026', '1104300537302', 'นาย', 'ธีรพัฒน์', 'คงหิรัญ', 'ปวส.1', 'เทคโนโลยีคอมพิวเตอร์', 2),
('64309010027', '1209301117432', 'นาย', 'นทีธร', 'บุญสอาด', 'ปวส.1', 'เทคโนโลยีคอมพิวเตอร์', 2),
('64309010028', '1209601364559', 'นางสาว', 'นันทวดี', 'วันจงคำ', 'ปวส.1', 'เทคโนโลยีคอมพิวเตอร์', 2),
('64309010029', '1209601354243', 'นาย', 'บัณฑัต', 'ต๊ะตา', 'ปวส.1', 'เทคโนโลยีคอมพิวเตอร์', 2),
('64309010030', '1601101375658', 'นาย', 'บูรพา', 'พรมมารักษ์', 'ปวส.1', 'เทคโนโลยีคอมพิวเตอร์', 2),
('64309010031', '1129701292194', 'นางสาว', 'ปัณฑิกา', 'ชาตะรี', 'ปวส.1', 'เทคโนโลยีคอมพิวเตอร์', 2),
('64309010032', '1350101676153', 'นางสาว', 'พนิตพิชา', 'อยู่เย็น', 'ปวส.1', 'เทคโนโลยีคอมพิวเตอร์', 2),
('64309010033', '1209601364087', 'นางสาว', 'พัณณิตา', 'บุญประเสริฐ', 'ปวส.1', 'เทคโนโลยีคอมพิวเตอร์', 2),
('64309010034', '1200901331399', 'นาย', 'ภัทรพงศ์', 'รอดเรือง', 'ปวส.1', 'เทคโนโลยีคอมพิวเตอร์', 2),
('64309010035', '1640401138561', 'นาย', 'วงศธร', 'สีดางาม', 'ปวส.1', 'เทคโนโลยีคอมพิวเตอร์', 2),
('64309010036', '2200901041917', 'นาย', 'วศิน', 'สินสงบ', 'ปวส.1', 'เทคโนโลยีคอมพิวเตอร์', 2),
('64309010037', '1219900858553', 'นางสาว', 'สาธินี', 'พละทรัพย์', 'ปวส.1', 'เทคโนโลยีคอมพิวเตอร์', 2),
('64309010038', '1209601355096', 'นาย', 'สุธนัย', 'จันทร์ประเสริฐ', 'ปวส.1', 'เทคโนโลยีคอมพิวเตอร์', 2),
('64309010039', '1102900052383', 'นาย', 'อาทิตย์', 'สาทพันธุ์', 'ปวส.1', 'เทคโนโลยีคอมพิวเตอร์', 2),
('64309010042', '1729900604727', 'นางสาว', 'กัลยรัตน์', 'กลิ่นหอม', 'ปวส.1', 'เทคโนโลยีสารสนเทศ', 1);

-- --------------------------------------------------------

--
-- Table structure for table `user`
--

CREATE TABLE `user` (
  `user_id` int(10) NOT NULL,
  `email` varchar(50) COLLATE utf8_unicode_ci DEFAULT NULL,
  `password` varchar(50) COLLATE utf8_unicode_ci DEFAULT NULL,
  `fname` varchar(50) COLLATE utf8_unicode_ci DEFAULT NULL,
  `lname` varchar(50) COLLATE utf8_unicode_ci NOT NULL,
  `position` enum('admin','staff') COLLATE utf8_unicode_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `user`
--

INSERT INTO `user` (`user_id`, `email`, `password`, `fname`, `lname`, `position`) VALUES
(1, 'ppimkot@gmail.com', '1234', 'ปพนพัทธ์', 'พิมพ์คต', 'admin'),
(2, 'paponpat@tatc.ac.th', '1234', 'ปพนพัทธ์', 'พิมพ์คต', 'staff'),
(4, 'somchai@gmail.com', '1234', 'สมชาย', 'ยะหัวดง', 'staff'),
(6, 'abc@hotmail.com', '1234', 'ssaas', 'dasds', 'staff'),
(2147483647, '3411200343744', 'ปพนพัทธ์ พิมพ์คต', '4', '17', 'admin');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `major`
--
ALTER TABLE `major`
  ADD PRIMARY KEY (`major_id`);

--
-- Indexes for table `member`
--
ALTER TABLE `member`
  ADD PRIMARY KEY (`mem_id`);

--
-- Indexes for table `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`user_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `major`
--
ALTER TABLE `major`
  MODIFY `major_id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=24;

--
-- AUTO_INCREMENT for table `user`
--
ALTER TABLE `user`
  MODIFY `user_id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2147483648;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
